name: "model"
platform: "onnxruntime_onnx"
max_batch_size: 512


input [
    {
        name: "images"
        data_type: TYPE_FP32
        dims: [ 784 ]
    }
]

output [
    {
        name: "probas"
        data_type: TYPE_FP32
        dims: [ 10 ]
    }
]

instance_group [
    {
      count: 3
      kind: KIND_CPU
    }
]


dynamic_batching: {max_queue_delay_microseconds: 500}
